---
kind: method
id: M:Autodesk.Revit.DB.CurtainGridSet.ForwardIterator
source: html/dd2e6123-4be9-162d-ee79-2d576c7e30ff.htm
---
# Autodesk.Revit.DB.CurtainGridSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual CurtainGridSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.